# У всіх завданнях використовувати обробку винятків
#
# 1. Користувач вводить із клавіатури номер дня тижня (1-7).
# Необхідно вивести на екран назви дня тижня.
# Наприклад, якщо 1, на екрані напис понеділок, 2 — вівторок тощо.
#
# 2. Користувач вводить два числа.
# Визначити, чи рівні ці числа, і, якщо ні, вивести їх на екран у порядку зростання
#
# 3. Користувач вводить два числа та матем дію: + - * або /
# Залежно від введеної матем дії вивести результат

try:
    numday = int(input("Введіть номер дня тижня від 1 до 7\n"))
    if numday == 1:
        print("Понеділок")
    elif numday == 2:
        print("Вівторок")
    elif numday == 3:
        print("Середа")
    elif numday == 4:
        print("Четвер")
    elif numday == 5:
        print("П'ятниця")
    elif numday == 6:
        print("Субота")
    elif numday == 7:
        print("Неділя")
    else:
        print("Помилка, введіть цифри від 1 до 7")
except ValueError as error:
    print("Введіть цифри, будь ласка!")





